Another report, this time, without ever using `default_tags`!

main.tf
```
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 3.0"
    }
  }
}

provider "aws" {
  region = var.deploy_region
}

### VPC setup
resource "aws_vpc" "something" {
  cidr_block = "10.0.0.0/16"
  tags = {
    Name         = "something_vpc"
    created_by   = var.whoami
    created_tool = "terraform"
    created_date = local.todays_date
    team         = "systems"
    owner        = "team-systems"
  }
}

resource "aws_subnet" "something_subnet" {
  vpc_id     = aws_vpc.something.id
  cidr_block = "10.0.0.0/16"

  tags = {
    Name         = "something_subnet"
    created_by   = var.whoami
    created_tool = "terraform"
    created_date = local.todays_date
    team         = "systems"
    owner        = "team-systems"
  }
}


resource "aws_security_group" "something_sg" {
  name                   = "something_sg"
  description            = "For handling all connections to something"
  vpc_id                 = aws_vpc.something.id
  revoke_rules_on_delete = true

  ingress {
    description = "SSH"
    from_port   = 22
    to_port     = 22
    protocol    = "tcp"
    cidr_blocks = ["0.0.0.0/0"]
  }

  ingress {
    description      = "From self"
    self             = true
    from_port        = 0
    to_port          = 0
    protocol         = "-1"
    cidr_blocks      = ["0.0.0.0/0"]
    ipv6_cidr_blocks = ["::/0"]
  }

  egress {
    from_port        = 0
    to_port          = 0
    protocol         = "-1"
    cidr_blocks      = ["0.0.0.0/0"]
    ipv6_cidr_blocks = ["::/0"]
  }

  tags = {
    Name         = "something_sg"
    created_by   = var.whoami
    created_tool = "terraform"
    created_date = local.todays_date
    team         = "systems"
    owner        = "team-systems"
  }
}
```
variables.tf
```
variable "deploy_region" {
  description = "The region to deploy the instance into. Override for testing."
  type        = string
  default     = "us-east-1"
}

variable "source_ami_id" {
  description = "The AMI id of the source image that we created via packer"
  type        = string
}

variable "whoami" {
  description = "My name, that is, the user launching this terraform run, for putting into the tags, e.g. first_last"
  type        = string
}
```

locals.tf
```
locals {
  todays_date = formatdate("YYYY-MM-DD", timestamp())
}
```

Here are all three outputs, all run immediately, no one else has access to any of this, nothing removed but the command prompt:
```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.0"...
- Installing hashicorp/aws v3.68.0...
- Installed hashicorp/aws v3.68.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

```
$ terraform fmt . ; terraform apply -var 'whoami=foo_bar' -var 'deploy_region=us-east-2' -var 'source_ami_id=ami-0d8c0c76ee7a663db'

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.something_sg will be created
  + resource "aws_security_group" "something_sg" {
      + arn                    = (known after apply)
      + description            = "For handling all connections to something"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "From self"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "something_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = true
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.something_subnet will be created
  + resource "aws_subnet" "something_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/16"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.something will be created
  + resource "aws_vpc" "something" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.0.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = (known after apply)
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc.something: Creating...
aws_vpc.something: Creation complete after 3s [id=vpc-0734d47fd181a51e1]
aws_subnet.something_subnet: Creating...
aws_security_group.something_sg: Creating...
aws_subnet.something_subnet: Creation complete after 1s [id=subnet-02592914dbc54fd51]
aws_security_group.something_sg: Creation complete after 2s [id=sg-04cee30281953dad4]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

```
$ terraform fmt . ; terraform apply -var 'whoami=foo_bar' -var 'deploy_region=us-east-2' -var 'source_ami_id=ami-0d8c0c76ee7a663db'
aws_vpc.something: Refreshing state... [id=vpc-0734d47fd181a51e1]
aws_subnet.something_subnet: Refreshing state... [id=subnet-02592914dbc54fd51]
aws_security_group.something_sg: Refreshing state... [id=sg-04cee30281953dad4]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.something_sg will be updated in-place
  ~ resource "aws_security_group" "something_sg" {
        id                     = "sg-04cee30281953dad4"
        name                   = "something_sg"
      ~ tags                   = {
          - "Name"         = "something_sg"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
      ~ tags_all               = {
          - "Name"         = "something_sg"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.something_subnet will be updated in-place
  ~ resource "aws_subnet" "something_subnet" {
        id                              = "subnet-02592914dbc54fd51"
      ~ tags                            = {
          - "Name"         = "something_subnet"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name"         = "something_subnet"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_vpc.something will be updated in-place
  ~ resource "aws_vpc" "something" {
        id                               = "vpc-0734d47fd181a51e1"
      ~ tags                             = {
          - "Name"         = "something_vpc"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
      ~ tags_all                         = {
          - "Name"         = "something_vpc"
          - "created_by"   = "foo_bar"
          - "created_date" = "2021-12-08"
          - "created_tool" = "terraform"
          - "owner"        = "team-systems"
          - "team"         = "systems"
        } -> (known after apply)
        # (12 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes


Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

Nothing triggered this. Nothing could possibly have triggered this change, since no one else can access this test space.

Could this be the same problem as the unordered-lists-always-cause-drift issue (bug #11801 )?